Generate-TOC.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-11-25 六 09:37 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>How to Generate a Table of Contents in Docx with Python</title>
<meta name="author" content="ChanMo" />
<meta name="description" content="This tutorial will show you how to generate and refresh a table of contents (TOC) in a Docx document using Python" />
<meta name="keywords" content="table of contents, libreoffice, soffice, macro, toc, pandoc, unoserver, python-docx, chanmo" />
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' href='bulma.min.css'><link rel='stylesheet' href='app.css'>
</head>
<body>
<div id="preamble" class="status">
<nav class='navbar is-dark is-fixed-top'><div class='container' style='max-width:768px;padding:0 1.5rem;'><div class='navbar-brand'><a href='/' class='navbar-item'>CHANMO</a><a role='button' class='navbar-burger' aria-label='menu' aria-expanded='false' data-target='main-nav'><span aria-hidden='true'></span><span aria-hidden='true'></span><span aria-hidden='true'></span></a></div><div id='main-nav' class='navbar-menu'><div class='navbar-end'><a href='https://github.com/ChanMo' class='navbar-item' target='_blank'>Github</a><a href='./about.html' class='navbar-item'>About</a><div class='navbar-item'><input type='checkbox' class='is-hidden' id='toggle' /><label for='toggle'></label></div></div></div></div></nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">How to Generate a Table of Contents in Docx with Python</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga36e8fe">1. Create a TOC placeholder in the Docx document</a></li>
<li><a href="#org667a467">2. Generate the TOC</a>
<ul>
<li><a href="#org6c2036c">2.1. Method 1: Using a LibreOffice macro</a></li>
<li><a href="#org254c352">2.2. Method 2: Using Unoserver</a></li>
</ul>
</li>
</ul>
</div>
</nav>
<p>
Tables of contents (TOCs) are an essential part of long documents,
providing a quick overview of the document's structure and enabling easy navigation.
While most Office software packages offer built-in TOC generation mechanisms,
they can be difficult to call from code.
</p>

<p>
This blog post will show you how to generate a TOC in Docx with Python.
We will use the following steps:
</p>

<ol class="org-ol">
<li>Create a TOC placeholder in the Docx document.</li>
<li>Refresh the TOC.</li>
</ol>


<div id="outline-container-orga36e8fe" class="outline-2">
<h2 id="orga36e8fe"><span class="section-number-2">1.</span> Create a TOC placeholder in the Docx document</h2>
<div class="outline-text-2" id="text-1">
<p>
The first step is to create a TOC placeholder in the Docx document.
This can be done using the following Python code:
</p>

<p>
We will use the <code>python-docx</code> package.
</p>

<div class="org-src-container">
<pre class="src src-bash">pip install python-docx
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python">from docx.oxml.ns import qn
from docx.oxml import OxmlElement

def insert_toc(d, levels="1-3"):
      """
      Insert "Table of Contents" to Document

      Parameters:
      ------------

      d: Document Object
         文档对象

      levels: string
              default "1-3"
      根据 addheading 更新目录
      """
      sdt = OxmlElement('w:sdt')
      sdtpr = OxmlElement('w:sdtPr')
      docpartobj = OxmlElement('w:docPartObj')
      docpartgallery = OxmlElement('w:docPartGallery')
      docpartgallery.set(qn('w:val'), 'Table of Contents')
      docpartunique = OxmlElement('w:docPartUnique')
      docpartunique.set(qn('w:val'), 'true')
      docpartobj.append(docpartgallery)
      docpartobj.append(docpartunique)
      sdtpr.append(docpartobj)
      sdt.append(sdtpr)

      sdtcontent = OxmlElement('w:sdtContent')

      p = OxmlElement('w:p')
      r = OxmlElement('w:r')
      t = OxmlElement('w:t')
      t.text = 'Contents'
      r.append(t)
      p.append(r)
      sdtcontent.append(p)

      fldChar = OxmlElement('w:fldChar')  # creates a new element
      fldChar.set(qn('w:fldCharType'), 'begin')  # sets attribute on element
      instrText = OxmlElement('w:instrText')
      instrText.set(qn('xml:space'), 'preserve')  # sets attribute on element
      instrText.text = f'TOC \\o "{levels}" \\h \\z \\u'   # change 1-3 depending on heading levels you need

      fldChar2 = OxmlElement('w:fldChar')
      fldChar2.set(qn('w:fldCharType'), 'separate')
      # fldChar3 = OxmlElement('w:t')
      # fldChar3.text = "Right-click to update field."
      fldChar3 = OxmlElement('w:updateFields')
      fldChar3.set(qn('w:val'), 'true')
      fldChar2.append(fldChar3)

      fldChar4 = OxmlElement('w:fldChar')
      fldChar4.set(qn('w:fldCharType'), 'end')

      p2 = OxmlElement('w:p')
      r2 = OxmlElement('w:r')
      r2.append(fldChar)
      r2.append(instrText)
      r2.append(fldChar2)
      r2.append(fldChar4)
      p2.append(r2)

      sdtcontent.append(p2)
      sdt.append(sdtcontent)
      d._element.body.insert_element_before(sdt, *('w:sectPr',))

      return d  
</pre>
</div>

<p>
<a href="https://github.com/ChanMo/python-toc/blob/main/toc.py">Github</a>
</p>
</div>
</div>

<div id="outline-container-org667a467" class="outline-2">
<h2 id="org667a467"><span class="section-number-2">2.</span> Generate the TOC</h2>
<div class="outline-text-2" id="text-2">
<p>
We now have a TOC section in our document, but it's empty.
How do we refresh the TOC? There are two ways to do this:
</p>
</div>

<div id="outline-container-org6c2036c" class="outline-3">
<h3 id="org6c2036c"><span class="section-number-3">2.1.</span> Method 1: Using a LibreOffice macro</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>Create Macro Module</li>
</ol>

<div class="org-src-container">
<pre class="src src-basic">REM  *****  BASIC  *****

 Option Explicit

 Sub UpdateIndexes(path As String)
     '''Update indexes, such as for the table of contents''' 
     Dim doc As Object
     Dim args()

     doc = StarDesktop.loadComponentFromUrl(convertToUrl(path), "_default", 0, args())

     Dim i As Integer

     With doc ' Only process Writer documents
         If .supportsService("com.sun.star.text.GenericTextDocument") Then
             For i = 0 To .getDocumentIndexes().count - 1
                 .getDocumentIndexes().getByIndex(i).update()
             Next i
         End If
     End With ' ThisComponent

     doc.store()
     doc.close(True)

 End Sub ' UpdateIndexes  
</pre>
</div>

<p>
<a href="https://github.com/ChanMo/python-toc/blob/main/basic/Mdian/AutoToc.xba">Github</a>
</p>

<ol class="org-ol">
<li>Import the Macro Module</li>
</ol>

<pre class="example">
$ mv ~/.config/libreoffice/4/user/basic ~/basic_backup
$ cp basic ~/.config/libreoffice/4/user/ -r  
</pre>

<ol class="org-ol">
<li>Run the Command</li>
</ol>

<div class="org-src-container">
<pre class="src src-bash">$ soffice --headless "macro:///Standard.YourModuleName.UpdateIndex(/path/to/file.odt)"
</pre>
</div>
</div>
</div>

<div id="outline-container-org254c352" class="outline-3">
<h3 id="org254c352"><span class="section-number-3">2.2.</span> Method 2: Using Unoserver</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li>Pull the Unoserver Docker Image</li>
</ol>

<div class="org-src-container">
<pre class="src src-bash">docker pull chanmo/unoserver
</pre>
</div>

<ol class="org-ol">
<li>Run the Unoserver container</li>
</ol>

<div class="org-src-container">
<pre class="src src-bash">docker run -p 5000:5000 chanmo/unoserver
</pre>
</div>

<ol class="org-ol">
<li>Update the TOC Using HTTPie</li>
</ol>
<div class="org-src-container">
<pre class="src src-bash">http -f POST :5000/convert/docx file@/path/to/demo.docx -o demo.docx
</pre>
</div>

<p>
The disadvantage of using a LibreOffice macro is that the server needs to have LibreOffice installed. If you don't want to install LibreOffice, you can use the Unoserver method instead.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<script src='app.js'></script>
</div>
</body>
</html>